{

    "header":{
        "title": "Title of hesder",
        "cambioLingua": "Lenguage",
        "thema": "Swap thema",
        "about": "About me",
        "menu": {
            "header": "Courses",
            "javaBasic": "Basic Java",
            "javaAdvanced": "Advanced Java",
            "java": "Java",
            "database": "Database",
            "programmingFundamentals": "Programming fundamentals",
            "oop": "Object oriented programming",
            "javaBasicDescription": "In the ‘Basic Java’ course, we will cover the fundamental concepts of the Java language and object-oriented programming. The course is suitable for both beginners and those who want to consolidate their knowledge of Java. This course is characterized by a practical and project-oriented approach.",
            "javaAdvancedDescription": "The ‘Advanced Java’ course is designed for those who want to bring their skills to the next level, covering more advanced topics such as multi-thread programming, design patterns, security, the most commonly used frameworks such as Hibernate and JPA, and the development of complex projects.",
            "oopDescription": "descrizione in inglese",
            "subCourseComingSoon": "Coming soon"
        }
    },

    "title" : "Title of dick",
    "page":{
        "title":"another Title of dick"
    },

    "welcome":{
        "title": "DON'T PANIC",
        "linkStart": "Let's start",
        "messageOneLeft" : "Are you already a developer and want to learn a new language?",
        "messageOneRight" : "Do you want to be a developer and don't know where to start?",
        "messageTwoLeft" : "Do you want to learn the technologies needed to build your own applications?",
        "messageTwoRight" : "Do you want to learn the techniques and methodologies used in the world of work?",
        "messageThreeLeft" : "Here we will use and discuss the techniques, configurations, and methods used in the real world",
        "messageThreeRight" : "Here you will find everything you need to bring your ideas to life",
        "messageFour" : "I don't want to lie to you...",
        "messageFive" : "...it won't be easy, it will take study and hard work...",
        "messageSix" : "I will follow you step by step, brick by brick, we will use concrete examples and carry out a complete 360-degree project...",
        "messageSeven" : "...results will come soon, don't worry, and they will be fantastic! Don't not waste time and let's get started!"
    },

    "ContentBodyTutorial":{
        "buttonPrevious" : "Previous",
        "buttonNext": "Next",
        "legend" :{
            "header_table" : "Legend",
            "important_topic" : "Very important topic",
            "best_practice" : "Best practice",
            "complex_topic" : "Complex concept",
            "common_error" : "Common mistake",
            "trick" : "Trick"
        }
    },

    "contact":{
        "email":{
            "titleContact": "How can I help you?",
            "subTitleContact": "Let's talk!",
            "fistName": "First name",
            "lastName": "Last name",           
            "email": "eMail",
            "emailPlaceHolder": "blabla@email.com",
            "contactReason": "Reason for contact",
            "message": "Message to send",
            "firstNameError": "Name is required",
            "emailError": "Please enter a valid email",
            "buttonLabel": "Send message",
            "dropdownPlaceHolder": "Select a reason",
            "dropdownError": "The choice is mandatory",
            "motivation1": "Site suggestions",
            "motivation2": "Video suggestions",
            "motivation3": "Spelling error",
            "motivation4": "Conceptual inaccuracy",
            "motivation5": "Other",
            "invitationMessage1": "Your opinion is essential!",
            "invitationMessage2": "If you have noticed errors, inaccuracies, or have suggestions for improving the site, videos, or anything else that would enrich our community experience, please let me know!",
            "invitationMessage3": "Every contribution you share is valuable to the evolution and enrichment of the content, as well as to improving everyone's experience.",
            "invitationMessage4": "I am open to your comments and grateful for your help in making our space better for everyone!",
            "thnksMessage1": "Thank you for contacting me, I will reply as soon as possible.",
            "thnksMessage2": "In the meantime, I would like to remind you that you can also follow me on my",
            "thnksMessage3": "channel so you don't miss out on upcoming content!"
        }
    },

    "aboutme":{
        "who":{
            "title": "Who am I?",
            "subTitle": "I'll try to tell you something about myself",
            "p1": "Hello everyone, I'm Marco, the creator of javagalaxy.xyz, and I'm here to tell you a bit about my story and the passions that guide me in the fascinating universe of programming and computer science.",
            "p2":"Currently, I am a computer analyst at a consulting company specialized in the design and implementation of innovative solutions across various sectors.",
            "p3":"I am involved in the implementation of Java projects for the development of microservices-oriented applications in various domains, especially in the banking and financial sector, which demand precision and reliability.",
            "p4":"Consulting has provided me with the opportunity to explore and delve into the most advanced technologies, following the entire life cycle of an application, from the design phase to its actual deployment.",
            "p5":"This journey has allowed me to gain a comprehensive and in-depth understanding of the challenges and solutions in the enterprise domain.",
            "p6":"Through the platform and the channel",
            "p7":"of javagalaxy.xyz, I want to share with you not only my experience and knowledge but also the passion I have for the development and evolution of technologies.",
            "p8":"Every course, every video, or article will be an invitation to explore together the potentials of Java and the technologies shaping our digital future.",
            "p9":"Subscribe today and get ready for an immersive journey into the world of Java and the technological solutions that are shaping our tomorrow!"
        },
        "philosophie":{
            "title": "My philosophy",
            "p1":"The birth of javagalaxy.xyz and my channel",
            "p2":"is the result of an ambitious vision inspired by the deep belief that sharing my experience in the programming world can become a significant contribution for those who wish to learn and grow in the field of software development.",
            "p3":"At this moment, even though the community is not fully developed yet, I believe that the creation of a learning platform can become the fertile ground for the growth of a passionate and eager-to-learn community.",
            "p4":"Knowledge is the strength that characterizes us as human beings.",
            "p5":"The desire to learn and share knowledge is what sets us apart, fueling our individual and collective progress.",
            "p6":"In this context, javagalaxy aspires to be a place where the thirst for knowledge meets the willingness to share, creating a community built on values of continuous learning and collaboration.",
            "p7":"What drives this project is the belief that creating an environment where knowledge can flow freely will be the key to inspire, motivate, and cultivate a love for programming.",
            "p8":"javagalaxy is an invitation to explore, learn, and grow together, as I believe that every contribution, even the smallest one, can positively shape the future of our community.",
            "p9":"Thank you for being part of this journey of discovery and learning."
        },
        "future":{
            "title": "The future (and beyond!)",
            "p1":"Here, I want to share my vision for the future of this space dedicated to programming.",
            "p2":"Nothing written in stone, mind you.",
            "p3":"Ideas, so many ideas that I look forward to bringing to life or perhaps changing and adapting.",
            "p4":"The participation of the community will be crucial to understand which ideas work well, which ones should be changed, or which ones should be set aside.",
            "p5":"There is already a dedicated page for collecting your feedback, which I encourage you to use; you can find it",
            "p6":"here",
            "p7":"I want to make the community an integral part of the decision-making process.",
            "p8":"The main goal is to expand and enrich the javagalaxy.xyz platform with detailed and in-depth content that is always up-to-date, taking into account industry trends and changes, as well as, of course, the community.",
            "p9":"It should be a dynamic place, with continually evolving content to meet the changing needs of the programming world.",
            "p10":"I have in mind to provide the option to register on the platform so that the user can have their personal page where they can keep track of the courses they are taking, the progress of their studies, and other interactive elements such as exercises and the ability to interact with the rest of the community.",
            "p11":"There are many ideas, and I'm sure new ones will come, thanks to your feedback and suggestions.",
            "p12":"My channel",
            "p13":"will serve as support; I plan to create at least one in-depth video for each chapter of the courses on the platform, and here the community's involvement will be crucial. Additional explanatory or supplementary videos will depend mainly on your requests.",
            "p14":"Everything is still very raw; it will take time to improve both the platform, in terms of graphics (UI) and user experience (UX), and the YouTube channel, trying to find a format that can be enjoyable for everyone.",
            "p15":"The priority, at least in the initial phase, will be on the content of the platform and the videos on",
            "p16":"With this project, I aspire to create an educational and collaborative ecosystem that inspires and supports anyone who wishes to immerse themselves in the fascinating world of programming.",
            "p17":"The future is an adventure to be experienced together, and I'm excited to share this journey with you on javagalaxy.xyz... and beyond!"
        },
        "passion":{
            "title": "but to follow virtue and knowledge",
            "subTitle": "Hell Chant XXVI - Divine Comedy",
            "p1":"Welcome to this section dedicated to my passions, a brief journey through my nerdiness!",
            "p2":"I wanted to take some time to tell you about my passions, those fantastic worlds that captivate me every day.",
            "p3":"Of course, if there's one thing that lights up my eyes, it's development and programming. It's one of the few ways I have to express creativity through design, algorithms, and lines of code.",
            "p4":"I believe that computer science is the glue of all sciences, the connecting link that can somehow make various sciences collaborate in harmony rather than in isolation, and that's why I fell in love with it.",
            "p5":"Thanks to programming, I have the opportunity to delve into sciences at various depths, trying to satisfy my hunger for knowledge. Moreover, it allows me to tackle complex problems (which create a kind of addiction for me!).",
            "p6":"The more complex the problem, the less I sleep at night! My brain doesn't shut down until it finds an acceptable solution! The more I know, the more I want to know, the deeper I go, and the more information and tools I have in my arsenal to hit the bullseye for a solution!",
            "p7":"Hence, the title of this section, which better captured my thoughts.",
            "p8":"Follow your passions, and you will never be tired of learning!",
            "p9":"Development now occupies a significant part of my time, so I don't think I'll be able to become the Pirate King, let alone a Hokage. I can't even dedicate as much time as I'd like to play my favorite sagas like Final Fantasy or Metal Gear, or enjoy anime without interruption as I used to (for the record, my favorite is, and will remain, Death Note). Who knows, maybe one day I'll go back to doing all that like before; I don't hide that I miss it a bit.",
            "p10":"For now, I content myself with watching the occasional video on YouTube to stay updated on these topics, dreaming of experiencing them someday!",
            "p11":"Despite everything, I manage to preserve physical activity and my passion for music. Whenever I can, even if just for 5 minutes, I grab my guitar (always by my side) and strum something (fortunately, no one listens to me!",
            "p12":"I'm sure we'll have the opportunity to delve into and share our passions, but now it's coding time!",
            "p13":"May the force be with you!"
        }
    },

    "footer":{
        "about" : "About me",
        "contact" : "Contact me"
    }

  
}